In [11]:
from sqlalchemy import create_engine
import pandas as pd

In [12]:
cnx = create_engine('postgresql://tiffanyli:021422@52.14.108.180:5432/tiffanyli')
#port ~ 5432

In [13]:
pd.read_sql_query('''SELECT * FROM allstarfull LIMIT 5''',cnx)

    playerid  yearid gamenum        gameid teamid lgid gp startingpos
0  gomezle01    1933       0  ALS193307060    NYA   AL  1           1
1  ferreri01    1933       0  ALS193307060    BOS   AL  1           2
2  gehrilo01    1933       0  ALS193307060    NYA   AL  1           3
3  gehrich01    1933       0  ALS193307060    DET   AL  1           4
4  dykesji01    1933       0  ALS193307060    CHA   AL  1           5

In [7]:
# Tables: allstarfull, schools, Salaries

What was the total spent on salaries by each team, each year?

In [24]:
pd.read_sql_query('''SELECT teamid, yearid, SUM(salary) FROM Salaries GROUP BY teamid, yearid LIMIT 10''', cnx)

  teamid  yearid          sum
0    SLN    2009   88528409.0
1    KCA    1995   29532834.0
2    ANA    1999   55388166.0
3    SEA    2007  106460833.0
4    PHI    1991   22487332.0
5    SDN    1990   17588334.0
6    SLN    2010   93540751.0
7    LAA    2011  138543166.0
8    CLE    1987    8513750.0
9    NYN    2009  149373987.0

What is the first and last year played for each player? Hint: Create a new table from 'Fielding.csv'.

In [21]:
pd.read_sql_query('''SELECT playerid, min(yearid), max(yearid) FROM Fielding GROUP BY playerid LIMIT 5''',cnx)

    playerid     min     max
0  gagnied01  1914.0  1915.0
1  ramospe01  1955.0  1970.0
2  putkolu01  2012.0  2013.0
3  boyerke01  1955.0  1969.0
4  dillibo01  1946.0  1951.0

Who has played the most all star games?

In [34]:
pd.read_sql_query('''SELECT playerid, COUNT(playerid) FROM allstarfull GROUP BY playerid ORDER BY count DESC LIMIT 10''', cnx)

    playerid  count
0  aaronha01     25
1  musiast01     24
2   mayswi01     24
3  mantlmi01     20
4  ripkeca01     19
5  willite01     19
6  yastrca01     18
7  kalinal01     18
8  robinbr01     18
9  berrayo01     18

Which school has generated the most distinct players? Hint: Create new table from 'CollegePlaying.csv'.

In [27]:
pd.read_sql_query('''SELECT schoolid, COUNT(DISTINCT playerid) FROM CollegePlaying GROUP BY schoolid ORDER BY (COUNT(DISTINCT playerid)) DESC LIMIT 5''',cnx)

    schoolid  count
0        usc    102
1      texas    100
2  arizonast     98
3   stanford     82
4   michigan     77

Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career. Hint: Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the DATE function and can then be subtracted from each other yielding their difference in days.

In [56]:
pd.read_sql_query('''SELECT playerid, DATE(finalgame)-DATE(debut) as days FROM master WHERE debut != 'None' and finalgame != 'None' ORDER BY days DESC LIMIT 5 ''',cnx)

    playerid   days
0  altroni01  12862
1  orourji01  11836
2  minosmi01  11492
3  olearch01  11126
4  lathaar01  10678

In [67]:
pd.read_sql_query('''SELECT * FROM master LIMIT 5''', cnx)

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,aardsda01,1981,12,27,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
1,aaronha01,1934,2,5,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939,8,5,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190,75,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954,9,8,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190,75,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972,8,25,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184,73,L,L,2001-09-10,2006-04-13,abada001,abadan01

What is the distribution of debut months? Hint: Look at the DATE and EXTRACT functions.

In [72]:
pd.read_sql_query('''SELECT EXTRACT(MONTH FROM DATE(debut)) as month, COUNT(playerid) FROM master GROUP BY month ORDER BY COUNT(playerid) DESC''', cnx)

   month  count
0    9.0   5061
1    4.0   4711
2    5.0   2230
3    7.0   1978
4    8.0   1943
5    6.0   1893
6   10.0    308
7    NaN    189
8    3.0     41

What is the effect of table join order on mean salary for the players listed in the main (master) table? Hint: Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

In [75]:
pd.read_sql_query('''SELECT * FROM salaries LEFT JOIN master ON salaries.playerid = master.playerid LIMIT 5''', cnx)

,yearid,teamid,lgid,playerid,salary,playerid,birthyear,birthmonth,birthday,birthcountry,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,2012,NYA,AL,aardsda01,500000.0,aardsda01,1981,12,27,USA,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
1,2011,SEA,AL,aardsda01,4500000.0,aardsda01,1981,12,27,USA,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
2,2010,SEA,AL,aardsda01,2750000.0,aardsda01,1981,12,27,USA,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
3,2009,SEA,AL,aardsda01,419000.0,aardsda01,1981,12,27,USA,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
4,2008,BOS,AL,aardsda01,403250.0,aardsda01,1981,12,27,USA,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01

In [76]:
pd.read_sql_query('''SELECT * FROM master LEFT JOIN salaries ON master.playerid = salaries.playerid LIMIT 5''', cnx)

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,throws,debut,finalgame,retroid,bbrefid,yearid,teamid,lgid,playerid,salary
0,aardsda01,1981,12,27,USA,CO,Denver,None,None,None,...,R,2004-04-06,2013-09-28,aardd001,aardsda01,2004,SFN,NL,aardsda01,300000.0
1,aardsda01,1981,12,27,USA,CO,Denver,None,None,None,...,R,2004-04-06,2013-09-28,aardd001,aardsda01,2007,CHA,AL,aardsda01,387500.0
2,aardsda01,1981,12,27,USA,CO,Denver,None,None,None,...,R,2004-04-06,2013-09-28,aardd001,aardsda01,2008,BOS,AL,aardsda01,403250.0
3,aardsda01,1981,12,27,USA,CO,Denver,None,None,None,...,R,2004-04-06,2013-09-28,aardd001,aardsda01,2009,SEA,AL,aardsda01,419000.0
4,aardsda01,1981,12,27,USA,CO,Denver,None,None,None,...,R,2004-04-06,2013-09-28,aardd001,aardsda01,2010,SEA,AL,aardsda01,2750000.0